# Задача 1

password = input("Введите пароль: ")
password_check = input("Подтвердите пароль: ")

if password == password_check:
    print("Пароль принят.")
else:
    print("Пароль не принят.")

 